Linux/LinuxOS/xclip.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>xclip剪切板与终端的通道</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="xclip剪切板与终端的通道"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-06 07:31:18 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>


<div id="content">
<h1 class="title">xclip剪切板与终端的通道</h1>


<script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script>
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/vf.css" />
<script src="../../Layout/JS/bootstrap_old.js"></script>


<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 xclip</a></li>
<li><a href="#sec-2">2 终端输出保存到剪切板中</a></li>
<li><a href="#sec-3">3 文件内容复制到剪切板中</a></li>
<li><a href="#sec-4">4 剪切板内容输出到终端</a></li>
<li><a href="#sec-5">5 剪切板内容输出到文件</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> xclip</h2>
<div class="outline-text-2" id="text-1">

<p>  xclip命令建立了终端和剪切板之间通道，可以用命令的方式将终端输出或文件的内容保存到剪切板中，也可以将剪切板的内容输出到终端或文件<br/>
  不加选项时只在保存在X PRIMARY（应该是终端剪切板），加上选项 -selection c后保存在 X CLIPBOARD（应该是外部程序剪切板）。<br/>
  参考：<a href="http://www.debian-administration.org/articles/565">http://www.debian-administration.org/articles/565</a><br/>
  安装 sudo apt-get xclip<br/>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 终端输出保存到剪切板中</h2>
<div class="outline-text-2" id="text-2">




<pre class="example">ls -al | xclip
</pre>

<p>
  此时ls -al的输出内容已经保存在剪切板中了，此时xclip -o可以看到剪切板的内容。<br/>
  但此时还不可以粘贴到终端以外的程序中，此时需要用到： <code>xclip -selection c</code> <br/>
</p>


<pre class="example">ls -al | xclip -selection c
</pre>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 文件内容复制到剪切板中</h2>
<div class="outline-text-2" id="text-3">




<pre class="example">xclip /etc/apt/sources.list
xclip -selection c /etc/apt/sources.list
</pre>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 剪切板内容输出到终端</h2>
<div class="outline-text-2" id="text-4">




<pre class="example">xclip -o
xclip -selection c -o
</pre>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 剪切板内容输出到文件</h2>
<div class="outline-text-2" id="text-5">




<pre class="example">xclip -o &gt; ~/test.txt
xclip -selection c -o &gt; ~/test.txt
</pre>


<a class="bshareDiv" href="http://www.bshare.cn/share">分享按钮</a><script type="text/javascript" charset="utf-8" src="http://static.bshare.cn/b/buttonLite.js#uuid=&amp;style=10&amp;bgcolor=Blue"></script>
<br/>
<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>


<p>  <br/>
</p></div>
</div>
</div>

</body>
</html>
